ninxmeow/Holy80/lib/chibios-contrib/os/common/ext/CMSIS/AT32/AT32F423xx/at32f423xx.h
#define DMA1_BASE                        (AHBPERIPH1_BASE + 0x6000)
#define DMA1_CHANNEL1_BASE               (DMA1_BASE + 0x0008)
#define DMA1_CHANNEL2_BASE               (DMA1_BASE + 0x001C)
#define DMA1_CHANNEL3_BASE               (DMA1_BASE + 0x0030)
#define DMA1_CHANNEL4_BASE               (DMA1_BASE + 0x0044)
#define DMA1_CHANNEL5_BASE               (DMA1_BASE + 0x0058)
#define DMA1_CHANNEL6_BASE               (DMA1_BASE + 0x006C)
#define DMA1_CHANNEL7_BASE               (DMA1_BASE + 0x0080)

#define DMA1MUX_BASE                     (DMA1_BASE + 0x0104)
#define DMA1MUX_CHANNEL1_BASE            (DMA1MUX_BASE)
#define DMA1MUX_CHANNEL2_BASE            (DMA1MUX_BASE + 0x0004)
#define DMA1MUX_CHANNEL3_BASE            (DMA1MUX_BASE + 0x0008)
#define DMA1MUX_CHANNEL4_BASE            (DMA1MUX_BASE + 0x000C)
#define DMA1MUX_CHANNEL5_BASE            (DMA1MUX_BASE + 0x0010)
#define DMA1MUX_CHANNEL6_BASE            (DMA1MUX_BASE + 0x0014)
#define DMA1MUX_CHANNEL7_BASE            (DMA1MUX_BASE + 0x0018)

#define DMA1MUX_GENERATOR1_BASE          (DMA1_BASE + 0x0120)
#define DMA1MUX_GENERATOR2_BASE          (DMA1_BASE + 0x0124)
#define DMA1MUX_GENERATOR3_BASE          (DMA1_BASE + 0x0128)
#define DMA1MUX_GENERATOR4_BASE          (DMA1_BASE + 0x012C)

#define DMA2_BASE                        (AHBPERIPH1_BASE + 0x6400)
#define DMA2_CHANNEL1_BASE               (DMA2_BASE + 0x0008)
#define DMA2_CHANNEL2_BASE               (DMA2_BASE + 0x001C)
#define DMA2_CHANNEL3_BASE               (DMA2_BASE + 0x0030)
#define DMA2_CHANNEL4_BASE               (DMA2_BASE + 0x0044)
#define DMA2_CHANNEL5_BASE               (DMA2_BASE + 0x0058)
#define DMA2_CHANNEL6_BASE               (DMA2_BASE + 0x006C)
#define DMA2_CHANNEL7_BASE               (DMA2_BASE + 0x0080)

#define DMA2MUX_BASE                     (DMA2_BASE + 0x0104)
#define DMA2MUX_CHANNEL1_BASE            (DMA2MUX_BASE)
#define DMA2MUX_CHANNEL2_BASE            (DMA2MUX_BASE + 0x0004)
#define DMA2MUX_CHANNEL3_BASE            (DMA2MUX_BASE + 0x0008)
#define DMA2MUX_CHANNEL4_BASE            (DMA2MUX_BASE + 0x000C)
#define DMA2MUX_CHANNEL5_BASE            (DMA2MUX_BASE + 0x0010)
#define DMA2MUX_CHANNEL6_BASE            (DMA2MUX_BASE + 0x0014)
#define DMA2MUX_CHANNEL7_BASE            (DMA2MUX_BASE + 0x0018)

#define DMA2MUX_GENERATOR1_BASE          (DMA2_BASE + 0x0120)
#define DMA2MUX_GENERATOR2_BASE          (DMA2_BASE + 0x0124)
#define DMA2MUX_GENERATOR3_BASE          (DMA2_BASE + 0x0128)
#define DMA2MUX_GENERATOR4_BASE          (DMA2_BASE + 0x012C)

#define FLASH_REG_BASE                   (AHBPERIPH1_BASE + 0x3C00)
#define CRM_BASE                         (AHBPERIPH1_BASE + 0x3800)
#define CRC_BASE                         (AHBPERIPH1_BASE + 0x3000)
#define OTGFS1_BASE                      (AHBPERIPH2_BASE + 0x00000)

/**
  * @}
  */

/** @addtogroup Peripheral_type_define
  * @{
  */

/**
  * @brief type define exint register all
  */
typedef struct
{

  /**
    * @brief exint inten register, offset:0x00
    */
  __IO uint32_t INTEN;

  /**
    * @brief exint evten register, offset:0x04
    */
  __IO uint32_t EVTEN;

  /**
    * @brief exint polcfg1 register, offset:0x08
    */
  __IO uint32_t POLCFG1;

  /**
    * @brief exint polcfg2 register, offset:0x0C
    */
  __IO uint32_t POLCFG2;

  /**
    * @brief exint swtrg register, offset:0x10
    */
  __IO uint32_t SWTRG;

  /**
    * @brief exint intsts register, offset:0x14
    */
  __IO uint32_t INTSTS;

} EXINT_TypeDef;

/**
  * @brief type define crm register all
  */
typedef struct
{
  /**
    * @brief crm ctrl register, offset:0x00
    */
  __IO uint32_t CTRL;

  /**
    * @brief crm pllcfg register, offset:0x04
    */
  __IO uint32_t PLLCFG;

  /**
    * @brief crm cfg register, offset:0x08
    */
  __IO uint32_t CFG;

  /**
    * @brief crm clkint register, offset:0x0C
    */
  __IO uint32_t CLKINT;

  /**
    * @brief crm ahbrst1 register, offset:0x10
    */
  __IO uint32_t AHBRST1;

  /**
    * @brief crm ahbrst2 register, offset:0x14
    */
  __IO uint32_t AHBRST2;

  /**
    * @brief crm ahbrst3 register, offset:0x18
    */
  __IO uint32_t AHBRST3;

  /**
    * @brief crm reserved1 register, offset:0x1C
    */
  __IO uint32_t RESERVED1;

  /**
    * @brief crm apb1rst register, offset:0x20
    */
  __IO uint32_t APB1RST;
  
  /**
    * @brief crm apb2rst register, offset:0x24
    */
  __IO uint32_t APB2RST;
    
  /**
    * @brief crm reserved2 register, offset:0x28~0x2C
    */
  __IO uint32_t RESERVED2[2];

  /**
    * @brief crm ahben1 register, offset:0x30
    */
  __IO uint32_t AHBEN1;

  /**
    * @brief crm ahben2 register, offset:0x34
    */
  __IO uint32_t AHBEN2;

  /**
    * @brief crm ahben3 register, offset:0x38
    */
  __IO uint32_t AHBEN3;

  /**
    * @brief crm reserved3 register, offset:0x3C
    */
  __IO uint32_t RESERVED3;

  /**
    * @brief crm apb1en register, offset:0x40
    */
  __IO uint32_t APB1EN;

  /**
    * @brief crm apb2en register, offset:0x44
    */
  __IO uint32_t APB2EN;
  
  /**
    * @brief crm reserved4 register, offset:0x48~0x4C
    */
  __IO uint32_t RESERVED4[2];

  /**
    * @brief crm ahblpen1 register, offset:0x50
    */
  __IO uint32_t AHBLPEN1;

  /**
    * @brief crm ahblpen2 register, offset:0x54
    */
  __IO uint32_t AHBLPEN2;

  /**
    * @brief crm ahblpen3 register, offset:0x58
    */
  __IO uint32_t AHBLPEN3;

  /**
    * @brief crm reserved5 register, offset:0x5C
    */
  __IO uint32_t RESERVED5;

  /**
    * @brief crm apb1lpen register, offset:0x60
    */
  __IO uint32_t APB1LPEN;

  /**
    * @brief crm apb2lpen register, offset:0x64
    */
  __IO uint32_t APB2LPEN;

  /**
    * @brief crm piclks register, offset:0x68
    */
  __IO uint32_t PICLKS;

  /**
    * @brief crm reserved6 register, offset:0x6C
    */
  __IO uint32_t RESERVED6;

  /**
    * @brief crm bpdc register, offset:0x70
    */
  __IO uint32_t BPDC;
  
  /**
    * @brief crm ctrlsts register, offset:0x74
    */
  __IO uint32_t CTRLSTS;

  /**
    * @brief crm reserved7 register, offset:0x78~0x9C
    */
  __IO uint32_t RESERVED7[10];

  /**
    * @brief crm misc1 register, offset:0xA0
    */
  __IO uint32_t MISC1;

  /**
    * @brief crm misc2 register, offset:0xA4
    */
  __IO uint32_t MISC2;

} CRM_TypeDef;

/**
  * @brief type define pwc register all
  */
typedef struct
{
  /**
    * @brief pwc ctrl register, offset:0x00
    */
  __IO uint32_t CTRL;

  /**
    * @brief pwc ctrlsts register, offset:0x04
    */
  __IO uint32_t CTRLSTS;

  /**
    * @brief crm reserved1 register, offset:0x08~0x0C
    */
  __IO uint32_t RESERVED1[2];

  /**
    * @brief pwc ldoov register, offset:0x10
    */
  __IO uint32_t LDOOV;

} PWC_TypeDef;

/**
  * @brief type define flash register all
  */
typedef struct
{
  /**
    * @brief flash psr register, offset:0x00
    */
  __IO uint32_t PSR;

  /**
    * @brief flash unlock register, offset:0x04
    */
  __IO uint32_t UNLOCK;

  /**
    * @brief flash usd unlock register, offset:0x08
    */
  __IO uint32_t USD_UNLOCK;

  /**
    * @brief flash sts register, offset:0x0C
    */
  __IO uint32_t STS;

  /**
    * @brief flash ctrl register, offset:0x10
    */
  __IO uint32_t CTRL;

  /**
    * @brief flash addr register, offset:0x14
    */
  __IO uint32_t ADDR;

  /**
    * @brief flash reserved1 register, offset:0x18
    */
  __IO uint32_t RESERVED1;

  /**
    * @brief flash usd register, offset:0x1C
    */
  __IO uint32_t USD;

  /**
    * @brief flash epps register, offset:0x20
    */
  __IO uint32_t EPPS;

  /**
    * @brief flash reserved2 register, offset:0x70~0x24
    */
  __IO uint32_t RESERVED2[20];

  /**
    * @brief flash slib_sts0 register, offset:0x74
    */
  __IO uint32_t SLIB_STS0;

  /**
    * @brief flash slib_sts1 register, offset:0x78
    */
  __IO uint32_t SLIB_STS1;

  /**
    * @brief flash slib_pwd_clr register, offset:0x7C
    */
  __IO uint32_t SLIB_PWD_CLR;

  /**
    * @brief flash slib_misc_sts register, offset:0x80
    */
  __IO uint32_t SLIB_MISC_STS;

  /**
    * @brief flash crc_addr register, offset:0x84
    */
  __IO uint32_t CRC_ADDR;

  /**
    * @brief flash crc_ctrl register, offset:0x88
    */
  __IO uint32_t CRC_CTRL;

  /**
    * @brief flash crc_chkr register, offset:0x8C
    */
  __IO uint32_t CRC_CHKR;

  /**
    * @brief flash reserved3 register, offset:0x15C~0x90
    */
  __IO uint32_t RESERVED3[52];

  /**
    * @brief flash slib_set_pwd register, offset:0x160
    */
  __IO uint32_t SLIB_SET_PWD;

  /**
    * @brief flash slib_set_range register, offset:0x164
    */
  __IO uint32_t SLIB_SET_RANGE;

  /**
    * @brief flash em_slib_set register, offset:0x168
    */
  __IO uint32_t EM_SLIB_SET;

  /**
    * @brief flash btm_mode_set register, offset:0x16C
    */
  __IO uint32_t BTM_MODE_SET;

  /**
    * @brief flash slib_unlock register, offset:0x170
    */
  __IO uint32_t SLIB_UNLOCK;

} FLASH_TypeDef;

/**
  * @brief type define gpio register all
  */
typedef struct
{
  /**
    * @brief gpio mode register, offset:0x00
    */
  __IO uint32_t CFGR;

  /**
    * @brief gpio output type register, offset:0x04
    */
  __IO uint32_t OMODE;

  /**
    * @brief gpio output driver register, offset:0x08
    */
  __IO uint32_t ODRVR;

  /**
    * @brief gpio pull up/down register, offset:0x0C
    */
  __IO uint32_t PULL;

  /**
    * @brief gpio input data register, offset:0x10
    */
  __IO uint32_t IDT;

  /**
    * @brief gpio output data register, offset:0x14
    */
  __IO uint32_t ODT;

  /**
    * @brief gpio scr register, offset:0x18
    */
  __IO uint32_t SCR;

  /**
    * @brief gpio wpen register, offset:0x1C
    */
  __IO uint32_t WPR;

  /**
    * @brief gpio muxl register, offset:0x20
    */
  __IO uint32_t MUXL;

  /**
    * @brief gpio muxh register, offset:0x24
    */
  __IO uint32_t MUXH;

  /**
    * @brief gpio clr register, offset:0x28
    */
  __IO uint32_t CLR;

  /**
    * @brief gpio togr register, offset:0x2C
    */
  __IO uint32_t TOGR;

  /**
    * @brief gpio reserved1 register, offset:0x30~0x38
    */
  __IO uint32_t RESERVED1[3];

  /**
    * @brief gpio hdrv register, offset:0x3C
    */
  __IO uint32_t HDRV;

